@echo off
chcp 65001 > nul

setlocal enabledelayedexpansion

rem Перевірка наявності параметру /help
if "%~1" == "/help" or "%~1" == "/?" (
    echo Помилка: Неправильний синтаксис.
    echo.
    echo Довідка: Використання командного рядка:
    echo   pg.bat [шлях_до_каталогу] [ім'я_підкаталогу]
    echo.
    echo   Шлях_до_каталогу - обов'язковий параметр, шлях до каталогу, у якому шукається підкаталог.
    echo   Ім'я_підкаталогу   - обов'язковий параметр, ім'я підкаталогу, яке потрібно знайти.
    echo.
    echo Приклади використання:
    echo   pg.bat C:\Назва_каталогу Назва_підкаталога
    pause
    exit /b 0
)

rem Перевірка чи був переданий каталог як параметр
if "%~1" == "" (
    echo Помилка: Неправильний синтаксис.
    echo.
    echo Довідка: Використання командного рядка:
    echo   pg.bat [шлях_до_каталогу] [ім'я_підкаталогу]
    echo.
    echo   Шлях_до_каталогу - обов'язковий параметр, шлях до каталогу, у якому шукається підкаталог.
    echo   Ім'я_підкаталогу   - обов'язковий параметр, ім'я підкаталогу, яке потрібно знайти.
    echo.
    echo Приклади використання:
    echo   pg.bat C:\Назва_каталогу Назва_підкаталога
    pause
    exit /b 1
)

if "%~2" == "" (
    echo Помилка: Неправильний синтаксис.
    echo.
    echo Довідка: Використання командного рядка:
    echo   pg.bat [шлях_до_каталогу] [ім'я_підкаталогу]
    echo.
    echo   Шлях_до_каталогу - обов'язковий параметр, шлях до каталогу, у якому шукається підкаталог.
    echo   Ім'я_підкаталогу   - обов'язковий параметр, ім'я підкаталогу, яке потрібно знайти.
    echo.
    echo Приклади використання:
    echo   pg.bat C:\Назва_каталогу Назва_підкаталога
    pause
    exit /b 1
)

set "target_directory=%~1"
set "target_subdirectory=%~2"

rem Перевірка чи існує вказаний каталог
if not exist "%target_directory%" (
    echo Помилка: Вказаний каталог не існує.
    pause
    exit /b 1
)

rem Перевірка чи каталог є каталогом, а не файлом
if not exist "%target_directory%\" (
    echo Помилка: Вказаний шлях не є каталогом.
    pause
    exit /b 1
)

rem Перевірка чи є вказаний каталог прихованим, тільки для читання або архівним
for %%A in ("%target_directory%") do (
    set attribs=%%~aA
    if "!attribs:~3,1!" == "h" (
        echo Помилка: Вказаний каталог прихований.
        pause
        exit /b 1
    )
    if "!attribs:~2,1!" == "r" (
        echo Помилка: Вказаний каталог має атрибут тільки для читання.
        pause
        exit /b 1
    )
    if "!attribs:~5,1!" == "a" (
        echo Помилка: Вказаний каталог архівний.
        pause
        exit /b 1
    )
)





rem Перевірка чи існує підкаталог з вказаним ім'ям
for /d %%i in ("%target_directory%\*") do (
    set "subdir=%%~nxi"
    if "!subdir!"=="%target_subdirectory%" (
        echo Знайдено підкаталог з вказаним ім'ям: %%i
        pause
        exit /b 0
    )
)

echo Підкаталог з ім'ям "%target_subdirectory%" не знайдено.
pause
exit /b 1